* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA
LOCAL
END-DEFINE
DEFINE SUBROUTINE INTERNAL-SUB
DEFINE SUBROUTINE NESTED-SUB
IGNORE
END-SUBROUTINE
END-SUBROUTINE

END
