* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA LOCAL
END-DEFINE

DEFINE SUBROUTINE VERY-VERY-VERY-VERY-LONG-NAME-SOME-MIGHT-SAY-TO-LONG
    IGNORE
END-SUBROUTINE

END
