* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA LOCAL
END-DEFINE
PERFORM VERY-VERY-VERY-VERY-LONG-NAME-SO-THIS-DOES-NOT-MATTER-BECAUSE-VERY-LONG
END
