DEFINE DATA PARAMETER
/* >Natural Source Header 000000
/* :Mode S
/* :CP
/* <Natural Source Header
01 NUTESTP
  02 TESTLIB (A8)
  02 TESTCASE (A8)
  02 FIXTURE (A) DYNAMIC
  02 TEST (A) DYNAMIC
  02 TEST-DATA-PARAM (A) DYNAMIC
  02 HAS-SETUP (L)
  02 HAS-TEARDOWN (L)
  02 RUN-SETUP-TESTCASE (L)
  02 RUN-TEARDOWN-TESTCASE (L)
  02 RESULT (N1)
  02 NUM-ASSERTS (I4)
  02 MESSAGE (A) DYNAMIC
  02 TEST-DATA (A/1:*) DYNAMIC
END-DEFINE
