* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA LOCAL
PARAMETER USING NUTESTP
END-DEFINE
DEFINE SUBROUTINE TEST
IF NUTESTP.TEST EQ 'This is such a fancy test'
  IGNORE
END-IF
IF NUTESTP.TEST EQ 'This is such a fancy test'
  IGNORE
END-IF
END-SUBROUTINE
END
