DEFINE DATA
PARAMETER USING NUTESTP
END-DEFINE

IF NUTESTP.TEST EQ 'Outside of Subroutine'
IGNORE
END-IF

DEFINE SUBROUTINE OTHER-ROUTINE
IF NUTESTP.TEST EQ 'Also not in TEST'
IGNORE
END-IF
END-SUBROUTINE

DEFINE SUBROUTINE TEST
IF NUTESTP.TEST EQ 'In Test'
IGNORE
END-IF
END-SUBROUTINE

END
