DB: 000 FILE: 100  - COMPLETE-DDM                      DEFAULT SEQUENCE:
TYPE: ADABAS

T L DB Name                              F Leng  S D Remark
- - -- --------------------------------  - ----  - - ------------------------
*      >Natural Source Header 000000
*      :CP
*
*
*      <Natural Source Header
*      Generation started
*      AT 2020-05-31 15:00:00
*      by user Adabasadmin
*
  1 AA SOME-NUMBER                       N   12  N
  1 AB ANOTHER-NUMBER                    N   12  N
  1 AC ALPHA-FIELD                       A    8  N
  1 AD ALPHANUMERIC-DESCRIPTOR           A   18    D
  1 AE NUMERIC-DESCRIPTOR                N   12  N D
  1 AF NUMERIC-WITH-FLOATING             N 12,7  N
G 1 GA TOP-LEVEL-GROUP                   N    7  N
  2 GB TOP-LEVEL-GROUP-CHILD             N   12  N
G 2 GC TOP-LEVEL-GROUP-GROUP             N    5  N
  3 GD TOP-LEVEL-GROUP-GROUP-CHILD       N    5  N
P 1 BA PERIODIC-GROUP
  2 BB PERIODIC-MEMBER                   N    2  N
  1 AG A-SUPERDESCRIPTOR                 A   20  N S
*      -------- SOURCE FIELD(S) -------
*      ALPHA-FIELD   (1-8)
*      ANOTHER-NUMBER(1-12)
  1 AH ANOTHER-SUPERDESCRIPTOR           A   20  N S
*      -------- SOURCE FIELD(S) -------
*      ALPHA-FIELD   (1-8)
*      ANOTHER-NUMBER(1-12)
  1 AI SUPERDESCRIPTOR-WITH-SUBRANGE     A   12  N S
*      -------- SOURCE FIELD(S) -------
*      SOME-NUMBER (1-5)
*      TOP-LEVEL-GROUP-CHILD (5-12)
  1 AJ UNIQUE-SUPER-WITH-SUBRANGE        A   32  N U
*      -------- SOURCE FIELD(S) -------
*      SOME-NUMBER (1-5)
*      ANOTHER-NUMBER(1-12)
*      ALPHA-FIELD   (1-8)
  1 AK HYPERDESCRIPTOR                   A   32  N H
  1 AL NONDESCRIPTOR                     A   32  N N
******DDM OUTPUT TERMINATED******
