* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA LOCAL
END-DEFINE

CALLNAT 'CALLED'

IGNORE

CALLNAT 'CALLED'

END