* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA
PARAMETER USING MYPDA
END-DEFINE

DEFINE SUBROUTINE MY-SUBROUTINE
    RESIZE ARRAY MYPDA.P-GROUP TO (1:1)
END-SUBROUTINE

END
