* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE SUBROUTINE WITHIN-SUB
    WRITE #THEGROUP.#THE-VARIABLE
END-SUBROUTINE
