DEFINE DATA LOCAL
1 #I (I4)
END-DEFINE

F1. FOR #I := 1 TO 10 /* !ref(2){LABELS,10,19;LABELS,14,19}
    PERFORM FIRSTESC
    PERFORM SECONDESC
END-FOR

DEFINE SUBROUTINE FIRSTESC
    ESCAPE BOTTOM (F1.)
END-SUBROUTINE

DEFINE SUBROUTINE SECONDESC
    ESCAPE BOTTOM (F1.)
END-SUBROUTINE

END
