DEFINE DATA
LOCAL
1 #AVAR (A10) /* !ref(2){SUB,7,6}
END-DEFINE
INCLUDE CCODE
IF 5 = 5
INCLUDE CCODE
WRITE #AVAR /* !ref(6){SUB,2,2}

DEFINE SUBROUTINE THE-SUB /* !ref(18){SUB,12,8}
CALLNAT 'SUB2'
END-SUBROUTINE
PERFORM THE-SUB /* !ref(10){SUB,9,18}
END-IF

END
