DEFINE DATA

PARAMETER USING SOMEPDA
GLOBAL USING SOMEGDA
LOCAL USING SOMELDA

END-DEFINE
CALLNAT 'CALLEDN' #TEST

DECIDE FOR CONDITION
    WHEN 5 = 5
        FETCH REPEAT 'SOMEPROG' 100
    WHEN FUNC(<>)
        IGNORE
    WHEN NONE
        IGNORE
END-DECIDE

PERFORM EXTERNAL-SUB #VAR

END
