DEFINE DATA
PARAMETER USING SOMEPDA
GLOBAL USING SOMEGDA
LOCAL USING SOMELDA
LOCAL
1 #PARM (A10) INIT<'Hi'>
END-DEFINE

CALLNAT 'CALLEDN' #PARM
IF TRUE
    CALLNAT 'CALLEDN' #PARM
END-IF

FETCH 'SOMEPROG' 50
IF TRUE
    FETCH RETURN 'SOMEPROG' 22
END-IF

IF FUNC(<>)
    IGNORE
END-IF

END
