* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA
LOCAL
1 #PATH (A) DYNAMIC
END-DEFINE

COMPRESS '$HOME' '/folder' '/file.txt' INTO #PATH

DEFINE WORK FILE 1 #PATH

END
