DEFINE DATA
LOCAL
1 #I (I4)
1 A-VIEW VIEW OF A-DDM
2 DDMFIELD (A10/*)
END-DEFINE

READ. READ A-VIEW BY ISN
IGNORE
END-READ

GET1. GET SAME (READ.)
WRITE DDMFIELD(GET1./#I.1) /* Should raise no diagnostic

END
