* >Natural Source Header 000000
* :Mode S
* :CP
* :LineIncrement 10
* <Natural Source Header
DEFINE FUNCTION ISTRUE
  RETURNS (L)
  DEFINE DATA
      PARAMETER
      01 #P-VAR (L)
  END-DEFINE

ISTRUE := #P-VAR

END-FUNCTION

END
