* >Natural Source Header 000000
* :Mode S
* :CP
* :LineIncrement 10
* <Natural Source Header
define data
local
end-define

FETCH RETURN 'PROG2'

ISTRUE(<TRUE>)


End
