DEFINE DATA
LOCAL USING MYLDA
LOCAL
1 #MY-VAR (A10)
END-DEFINE

INCLUDE CCODE

DEFINE SUBROUTINE INTERNAL-SUB
    IGNORE
END-SUBROUTINE

PERFORM INTERNAL-SUB

PERFORM MY-EXTERNAL #MY-VAR

CALLNAT 'SUB2'
END
