DEFINE FUNCTION FUNC
  RETURNS (A) DYNAMIC
  DEFINE DATA PARAMETER
  1 P-PARM (A) DYNAMIC
  LOCAL
  1 #VAR1 (I4)
  END-DEFINE

  #VAR1 := *LENGTH(P-PARM)
  FUNC := P-PARM
END-FUNCTION
END
