* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE FUNCTION FUNC

  RETURNS (L)

  DEFINE DATA
  LOCAL
  END-DEFINE

FUNC := TRUE

END-FUNCTION

END
