* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE FUNCTION FUNC2DIM

  RETURNS (N12,7/1:10,1:15)

  DEFINE DATA
  LOCAL
  END-DEFINE

FUNC2DIM := 'A'

END-FUNCTION

END
