* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE FUNCTION FUNCDYN

  RETURNS (A) DYNAMIC

  DEFINE DATA
  LOCAL
  END-DEFINE

FUNCDYN := 'A'

END-FUNCTION

END
