* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE FUNCTION FUNC

  RETURNS (N12,7)

  DEFINE DATA
  LOCAL
  END-DEFINE

FUNC := 'A'

END-FUNCTION

END
