* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE FUNCTION FUNC1DIM

  RETURNS (N12,7/1:10)

  DEFINE DATA
  LOCAL
  END-DEFINE

FUNC1DIM := 'A'

END-FUNCTION

END
