* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE FUNCTION FUNCRET

  RETURNS #RET (A1)

  DEFINE DATA
  LOCAL
  END-DEFINE

#RET := 'A'

END-FUNCTION

END
