* >Natural Source Header 000000
* :Mode S
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA LOCAL
1 #FIRSTGROUP
2 #THEVAR (A5)
1 #SECONDGROUPO
2 #THEVAR (A5)
END-DEFINE

WRITE #THEVAR

END