DEFINE DATA LOCAL
1 #RESULT (A10)
1 A-VIEW VIEW OF A-DDM
2 DDMFIELD (A10)
1 B-VIEW VIEW OF B-DDM
2 DDMFIELD (A10)
END-DEFINE

READ A-VIEW BY ISN
    #RESULT := DDMFIELD
END-READ

READ B-VIEW BY ISN
    #RESULT := DDMFIELD
END-READ

END
