* >Natural Source Header 000000
* :Mode S
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA LOCAL
1 A-VIEW VIEW OF A-DDM
  2 DDMFIELD-AA (A10)
1 B-VIEW VIEW OF A-DDM
  2 DDMFIELD-AB (A10)
1 C-VIEW VIEW OF A-DDM
  2 DDMFIELD-AC
  2 REDEFINE DDMFIELD-AC
    3 THREECHARS (A3)
    3 FILLER      7X

1 FIELD (A10)
END-DEFINE

LB1. READ A-VIEW BY ISN

  LB2. READ B-VIEW BY ISN

    FIELD := LB1.DDMFIELD-AA
    FIELD := LB2.DDMFIELD-AB

  END-READ

END-READ

LB3. HISTOGRAM C-VIEW FOR DDMROW

  FIELD := LB3.THREECHARS

END-HISTOGRAM

END

