* >Natural Source Header 000000
* :Mode S
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA
LOCAL
1 #GROUP
2 #INGROUP (N2)
1 #I (I4)
1 #ARR (N2/*)
END-DEFINE

FOR #I = 1 TO #INGROUP
    WRITE #I
END-FOR

FOR #I = 1 TO *OCC(#ARR)
    WRITE #I
END-FOR
END
