DEFINE DATA LOCAL
01 #VARONE (N12)
01 #VARTWO (N12)
01 #VARTHREE (N12)
END-DEFINE

#VARTHREE := #VARONE+#VARTWO /* Lexer produces "+#VARTWO" because it could be AIV

WRITE C*#VARONE

END
