* >Natural Source Header 000000
* :Mode S
* :CP
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA
LOCAL USING MYLDA
END-DEFINE

WRITE #IMPORTED-VAR

IF #IMPORTED-VAR EQ ' '
  #IMPORTED-VAR := 'Hello'
END-IF

END
