* >Natural Source Header 000000
* :Mode S
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA
LOCAL
01 #INSIDE-INCLUDE (A10)
END-DEFINE

INCLUDE MYCCODE

END
