* >Natural Source Header 000000
* :Mode S
* :CP
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA
LOCAL
01 #LOCALVAR (A10)
END-DEFINE

WRITE #LOCALVAR

IF #LOCALVAR EQ ' '
  #LOCALVAR := 'Hello'
END-IF

END
