* >Natural Source Header 000000
* :Mode S
* :LineIncrement 10
* <Natural Source Header
DEFINE DATA LOCAL
1 #MYVAR (A1)
END-DEFINE

WRITE T*#MYVAR

END
