* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA
LOCAL
END-DEFINE

INCLUDE USINGCC

DEFINE SUBROUTINE THE-SUB
IGNORE
END-SUBROUTINE

END
