* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA LOCAL
END-DEFINE

DEFINE SUBROUTINE EXTERNAL-SUBROUTINE
IGNORE
END-SUBROUTINE

END
