* >Natural Source Header 000000
* :Mode S
* :CP
* <Natural Source Header
DEFINE DATA LOCAL
END-DEFINE

DEFINE SUBROUTINE EXTERNAL-WITH-LOCAL

    DEFINE SUBROUTINE WITHIN-EXTERNAL
    IGNORE
    END-SUBROUTINE

END-SUBROUTINE

END
